app/Controllers/UserController.php

    public function index()
    {
        $data['title'] = "Users";
        $db = \Config\Database::connect();
        $role = $this->session->get('userdata')['u_role'];

        $query = $db->table('ek_admin');

        $query->where("ek_admin.u_id not in(1)");
        $query->join("ek_lkprole", "ek_lkprole.role_id = ek_admin.u_role");
        $query->orderBy("u_id", "ASC");
        $exercises = $query->get()->getResult();
---
SELECT *
FROM `ek_admin`
JOIN `ek_lkprole` ON `ek_lkprole`.`role_id` = `ek_admin`.`u_role`
WHERE `ek_admin`.`u_id` not in(1)
ORDER BY `u_id` ASC