app/Models/UserModel.php

    public function selectRole()
    {

        $db = \Config\Database::connect();
        $query = $db->table('ek_lkprole');
        $result = $query->orderBy("role_id", "ASC")->get();
---
SELECT *
FROM `ek_lkprole`
ORDER BY `role_id` ASC